In [226]:
import pandas as pd
import numpy as np
import matplotlib as plt
#const
theta0 = 0
theta1 = 0

In [227]:
data = pd.read_csv("data.csv")

In [228]:
data

        km  price
0   240000   3650
1   139800   3800
2   150500   4400
3   185530   4450
4   176000   5250
5   114800   5350
6   166800   5800
7    89000   5990
8   144500   5999
9    84000   6200
10   82029   6390
11   63060   6390
12   74000   6600
13   97500   6800
14   67000   6800
15   76025   6900
16   48235   6900
17   93000   6990
18   60949   7490
19   65674   7555
20   54000   7990
21   68500   7990
22   22899   7990
23   61789   8290

In [229]:
#y = b0 + b1*x
#B1 = covariance(x, y) / variance(x)
#covariance = sum((x(i) - mean(x)) * (y(i) - mean(y)))
#variance = sum( (x - mean(x))^2 )
data.describe()

                  km        price
count      24.000000    24.000000
mean   101066.250000  6331.833333
std     52674.245606  1319.654193
min     22899.000000  3650.000000
25%     65020.500000  5687.500000
50%     83014.500000  6495.000000
75%    140975.000000  7115.000000
max    240000.000000  8290.000000

In [197]:
'''
x = data['km'].values
y = data['price'].values
mean_x = np.mean(x)
mean_y = np.mean(y)
mean_x,mean_y
x,y
'''

(array([240000, 139800, 150500, 185530, 176000, 114800, 166800,  89000,
        144500,  84000,  82029,  63060,  74000,  97500,  67000,  76025,
         48235,  93000,  60949,  65674,  54000,  68500,  22899,  61789]),
 array([3650, 3800, 4400, 4450, 5250, 5350, 5800, 5990, 5999, 6200, 6390,
        6390, 6600, 6800, 6800, 6900, 6900, 6990, 7490, 7555, 7990, 7990,
        7990, 8290]))

(101066.25, 6331.833333333333)

In [230]:
#Program 1#
def predict(b0,b1):
    x = int(input())
    y = b0+b1*x
    return y
predict(b0,b1)

200000

4209.806931592756

In [231]:
#Program2#
def var(values,mean):
    return sum([(x-mean_x)**2 for x in values])

def covariance(x,mean_x,y,mean_y):
    cov = 0.0
    i = 0
    for i in range(len(x)):
        cov += (x[i]-mean_x)*(y[i]-mean_y)
    return cov
def train(data):
    x = data['km'].values
    y = data['price'].values
    mean_x = np.mean(x)
    mean_y = np.mean(y)
    cov = covariance(x,mean_x,y,mean_y)
    b1 = cov/var(x,mean_x)
    b0 = mean_y-b1*mean_x
    return(b0,b1)

In [232]:
b0,b1 = train(data)

In [233]:
b0,b1

(8499.599649933216, -0.0214489635917023)